# gateway-api - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `failure`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 0s [id=8749e4211ca99cade9b076b813b5cf495bc60174]
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/staging_gateway_api]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=6j1b28v9le]
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-staging_gateway_api]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-staging_gateway_api-20230505114002225900000001]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/staging_gateway_api]
module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default: Refreshing state... [id=staging_gateway_api_endpoint]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default has been deleted
  - resource "aws_apigatewayv2_api" "default" {
      - api_endpoint                 = "https://6j1b28v9le.execute-api.us-east-1.amazonaws.com" -> null
      - id                           = "6j1b28v9le" -> null
      - name                         = "staging_gateway_api" -> null
        tags                         = {
            "domain"        = "gateway"
            "environment"   = "staging"
            "resource"      = "gateway-api"
            "resource_type" = "api_gateway"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default has been deleted
  - resource "aws_cloudwatch_log_group" "default" {
      - arn               = "arn:aws:logs:us-east-1:754682412926:log-group:/aws/api_gateway/staging_gateway_api" -> null
        id                = "/aws/api_gateway/staging_gateway_api"
        name              = "/aws/api_gateway/staging_gateway_api"
        tags              = {
            "domain"        = "gateway"
            "environment"   = "staging"
            "resource"      = "gateway-api"
            "resource_type" = "api_gateway"
        }
        # (3 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.default has been deleted
  - resource "aws_iam_role" "default" {
        id                    = "lambda-execution-staging_gateway_api"
      - name                  = "lambda-execution-staging_gateway_api" -> null
        tags                  = {
            "domain"        = "gateway"
            "environment"   = "staging"
            "resource"      = "gateway-api"
            "resource_type" = "lambda"
        }
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default will be created
  + resource "aws_apigatewayv2_api" "default" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "gateway_api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all                     = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_methods     = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 0
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all      = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gateway/gateway_api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all          = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gateway_api_endpoint"
      + tags           = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all       = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "api_gateway"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/gateway_api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-gateway_api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "gateway"
          + "environment"   = "staging"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-gateway_api"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*